xively/xively-client-c/examples/cc3220sf/xively_demo/xively_example.c
/* Used by onLed handler function to differentiate LED's */
const static uint32_t gGreenLed  = CC3220SF_LAUNCHXL_LED_D5;
const static uint32_t gOrangeLed = CC3220SF_LAUNCHXL_LED_D6;
const static uint32_t gRedLed    = CC3220SF_LAUNCHXL_LED_D7;


/*****************************************************************************
                 Local Functions
*****************************************************************************/

/* @brief Clears out the Application Control Block which is used to track
 * configuration and connection status.  Initializes semaphores used
 * by the Provisioning System to notify the main applicatoin when a wifi
 * connection has been established.
 */
static void InitializeAppVariables()
{
    /* Clear the state of the control block */
    gApplicationControlBlock.gatewayIP               = 0;
    gApplicationControlBlock.status                  = 0;
    gApplicationControlBlock.xivelyConnectionStatus  = XI_CONNECTION_STATE_CLOSED;
    gApplicationControlBlock.button0State            = 0;
    gApplicationControlBlock.button1State            = 0;
    gApplicationControlBlock.desiredWifiSecurityType = 0;

    memset( gApplicationControlBlock.desiredWifiSSID, '\0',
            sizeof( gApplicationControlBlock.desiredWifiSSID ) );

    memset( gApplicationControlBlock.desiredWifiKey, '\0',
            sizeof( gApplicationControlBlock.desiredWifiKey ) );

    memset( gApplicationControlBlock.connectionSSID, '\0',
            sizeof( gApplicationControlBlock.connectionSSID ) );

    /* Clear the memory to store the WiFi SSID */
    memset( gApplicationControlBlock.connectionSSID, 0,
            sizeof( gApplicationControlBlock.connectionSSID ) );
    memset( gApplicationControlBlock.connectionBSSID, 0,
            sizeof( gApplicationControlBlock.connectionBSSID ) );

    /* initializes semaphores used in TI's Wifi IP Address Provisioning */
    sem_init( &Provisioning_ControlBlock.connectionAsyncEvent, 0, 0 );
    sem_init( &Provisioning_ControlBlock.provisioningDoneSignal, 0, 0 );
}

static void UpdateLEDProgressIndicators( UArg arg0 )
{
    static uint8_t toggle = Board_LED_OFF;

    if ( Board_LED_OFF == toggle )
    {
        toggle = Board_LED_ON;
    }
    else
    {
        toggle = Board_LED_OFF;
    }

    switch ( gApplicationControlBlock.initializationState )
    {
        case InitializationState_ReadingCredentials:
            GPIO_write( CC3220SF_LAUNCHXL_LED_D5, toggle );
            break;
        case InitializationState_ProvisioningWifi:
            GPIO_write( CC3220SF_LAUNCHXL_LED_D5, Board_LED_ON );
            GPIO_write( CC3220SF_LAUNCHXL_LED_D6, toggle );
            break;
        case InitializationState_ConnectingToXively:
            GPIO_write( CC3220SF_LAUNCHXL_LED_D5, Board_LED_ON );
            GPIO_write( CC3220SF_LAUNCHXL_LED_D6, Board_LED_ON );
            GPIO_write( CC3220SF_LAUNCHXL_LED_D7, toggle );
            break;

        case InitializationState_SubscribingToTopics:
            GPIO_write( CC3220SF_LAUNCHXL_LED_D5, toggle );
            GPIO_write( CC3220SF_LAUNCHXL_LED_D6, toggle );
            GPIO_write( CC3220SF_LAUNCHXL_LED_D7, toggle );

        case InitializationState_Complete:
            /* LEDs are now controlled by topics */
            break;
    }
}


/*****************************************************************************
                 Main Functions
*****************************************************************************/

/* @brief the main thread of the application.
 *
 * 1. Configures the GPIO, console logging and I2C subsystems for LED control, temperature
 * sensor readings and button interrupt handling.
 * 2. Reads configuration properites from a file in the flash file system for the
 * configuration
 * of simplelink wifi and to parse the user's Xively credentials.
 * 3. Starts a Simplelink provisioning task using a standard TI provisioning example as a
 * basis.
 * 4. Connects to Xively.
 * 5. Upon connection, allows the control of LEDs from the Xively Product launcher,
 * publishes button state changes when buttons are pressed on the sides of the device,
 * and periodically (every 5 seconds) publishes the temperature read from the device's on
 * board temperature sensor.
 */
void* xivelyExampleThread( void* arg )
{
    pthread_attr_t pAttrs;
    pthread_attr_t pAttrs_spawn;
    struct sched_param priParam;

    /* For WLAN Access */
    SPI_init();

    /* For LED Access & Button Support */
    GPIO_init();

    /* For Temperature Sensor */
    I2C_init();

    /* init Terminal */
    InitTerm();

/* Enable WolfSSL Debugging */
#ifdef DEBUB_WOLFSSL
    wolfSSL_Debugging_ON();
#endif /* DEBUG_WOLFSSL */

    /* Init Variables and Control Blocks */
    InitializeAppVariables();

    /* Print Application Name */
    Report( "\n\n\n\r" );
    Report( "\t\t =================================================\n\r" );
    Report( "\t\t      %s Ver. %s      \n\r", APPLICATION_NAME, APPLICATION_VERSION );
    Report( "\t\t =================================================\n\r" );
    Report( "\n\n\n\r" );

    /* Switch off all LEDs on board, for a nice clean state */
    GPIO_write( CC3220SF_LAUNCHXL_LED_D5, Board_LED_OFF );
    GPIO_write( CC3220SF_LAUNCHXL_LED_D6, Board_LED_OFF );
    GPIO_write( CC3220SF_LAUNCHXL_LED_D7, Board_LED_OFF );

    /* Add Interrupt Callbacks for the board's two side buttons */
    /* the application will use these interrupts to publish events */
    /* to the xively service on the corresponding button topic */
    GPIO_setCallback( Board_BUTTON0, button_interrupt_handler );
    GPIO_enableInt( Board_BUTTON0 );

    GPIO_setCallback( Board_BUTTON1, button_interrupt_handler );
    GPIO_enableInt( Board_BUTTON1 );

    /* create a periodic Clock for updating LED button states depending on
     * the current initialization state.  If an error occurs during
     * config file parsing, wifi provisioning or Xively Connection,
     * then the LED button states will let the user knows which stage something
     * went wrong. */
    Clock_Struct clk0Struct;
    Clock_Params clkParams;
    Clock_Params_init( &clkParams );
    clkParams.period    = 500; // 1 second
    clkParams.startFlag = TRUE;

    /* Construct a periodic Clock Instance */
    Clock_construct( &clk0Struct, ( Clock_FuncPtr )UpdateLEDProgressIndicators,
                     clkParams.period, &clkParams );

    /* create the simplelink task */
    /* Note: according to documentation, simplelink needs to run in it's own RTOS task */
    pthread_attr_init( &pAttrs_spawn );
    priParam.sched_priority = SPAWN_TASK_PRIORITY;

    uint32_t retval;
    retval = pthread_attr_setschedparam( &pAttrs_spawn, &priParam );
    retval |= pthread_attr_setstacksize( &pAttrs_spawn, TASK_STACK_SIZE );
    retval = pthread_create( &gSimpleLinkThread, &pAttrs_spawn, sl_Task, NULL );

    if ( retval )
    {
        Report( "Simplelink Task Creation pthread create returned an error: %d. ",
                retval );
        Report( "Looping forever\n\r" );
        while ( 1 )
            ;
    }

    /* start simplelink here so we can use the simplelink file API */
    retval = sl_Start( NULL, NULL, NULL );

