xively/xively-client-c/examples/cc3220sf/xively_demo/xively_example.c
    /* Parse Xively and Wifi Credentials from config file on flash file system */
    /* This data will be stored in the Application Control Block */
    gApplicationControlBlock.initializationState = InitializationState_ReadingCredentials;

    parseCredentialsFromConfigFile();

    /* Attempt to connect to the configured WiFi network */
    gApplicationControlBlock.initializationState = InitializationState_ProvisioningWifi;

    /* create a thread to grab an IP address from Wifi */
    /* This is called Provisioning on the TI CC3220     */
    pthread_attr_init( &pAttrs );
    priParam.sched_priority = 1;
    retval                  = pthread_attr_setschedparam( &pAttrs, &priParam );
    retval |= pthread_attr_setstacksize( &pAttrs, TASK_STACK_SIZE );

    if ( retval )
    {
        Report( "Provisioning Task Creation pthread config returned an error: %d. ",
                retval );
        Report( "Looping forever\n\r" );
        while ( 1 )
            ;
    }

    retval = pthread_create( &gProvisioningThread, &pAttrs, provisioningTask, NULL );

    if ( retval )
    {
        Report( "Provisioning Task Creation pthread create returned an error: %d. ",
                retval );
        Report( "Looping forever\n\r" );
        while ( 1 )
            ;
    }

    /* Wait for the Provisioning task to say that we have an IP address */
    retval = sem_wait( &Provisioning_ControlBlock.provisioningDoneSignal );
    if ( retval )
    {
        Report( "Semaphore returned error when waiting for Wifi Provisioning Task.\n\r" );
        Report( "Looping forever\n\r" );
        while ( 1 )
            ;
    }

    gApplicationControlBlock.initializationState = InitializationState_ConnectingToXively;

    /* At this point the device has a wifi address. */
    /* Let's kick off our connection to Xively! */
    Report( "Connecting to Xively!\n\r" );

    /* Xively Client Connect Code */
    ConnectToXively();

    /* start processing xively events */
    xi_events_process_blocking();

    /* when the event dispatcher is stopped, destroy the context */
    xi_delete_context( gXivelyContextHandle );

    /* shutdown the xively library */
    xi_shutdown();

    return ( 0 );
}

/* @brief Starts a connection to the Xively Service.  xi_events_process_blocking
 * should be called after this function so that the connection process can move
 * forward.
 */
void ConnectToXively()
{
    Report( "\t- Xively Account ID: %s\n", gApplicationControlBlock.xivelyAccountId );
    Report( "\t- Xively Device ID: %s\n", gApplicationControlBlock.xivelyDeviceId );
    Report( "\t- Xively Device Password: <secret>\n" );
    // Report( "\t- Xively Device Pwd: %s\n",
    //        gApplicationControlBlock.xivelyDevicePassword );
    xi_state_t ret_state = xi_initialize( gApplicationControlBlock.xivelyAccountId,
                                          gApplicationControlBlock.xivelyDeviceId );

    if ( XI_STATE_OK != ret_state )
    {
        UART_PRINT( "xi failed to initialize\n\r" );
        return;
    }

    gXivelyContextHandle = xi_create_context();

    if ( XI_INVALID_CONTEXT_HANDLE == gXivelyContextHandle )
    {
        UART_PRINT( " xi failed to create context, error: %d\n\r",
                    -gXivelyContextHandle );
        return;
    }

    xi_state_t connect_result =
        xi_connect( gXivelyContextHandle, gApplicationControlBlock.xivelyDeviceId,
                    gApplicationControlBlock.xivelyDevicePassword, 10, 0,
                    XI_SESSION_CLEAN, &on_connected );
}

/* @brief Connection callback.  See xively.h for full signature information
 *
 * @param in_context_handle the xively connection context as was returned from
 * xi_create_context. This denotes which connection is calling this callback and
 * could be used to differentiate connections if you have more than one ongoing.)
 * This value must be used for all Xively C Client operations.
 * @param data an abstract data pointer that is parsed differently depending on the
 * connection state.  See the source below for example usage.
 * @param state status / error code from xi_error.h that might be applicable
 * to the connection state change.
 * */
void on_connected( xi_context_handle_t in_context_handle, void* data, xi_state_t state )
{
    xi_connection_data_t* conn_data = ( xi_connection_data_t* )data;

    gApplicationControlBlock.xivelyConnectionStatus = conn_data->connection_state;

    switch ( conn_data->connection_state )
    {
        case XI_CONNECTION_STATE_OPEN_FAILED:
            Report( "connection to %s:%d has failed reason %d\n\r", conn_data->host,
                    conn_data->port, state );

            gApplicationControlBlock.initializationState =
                InitializationState_ConnectingToXively;

            xi_connect( in_context_handle, conn_data->username, conn_data->password,
                        conn_data->connection_timeout, conn_data->keepalive_timeout,
                        conn_data->session_type, &on_connected );

            return;
        case XI_CONNECTION_STATE_OPENED:
            Report( "Xively connected to %s:%d\n\r", conn_data->host, conn_data->port );

            gApplicationControlBlock.initializationState =
                InitializationState_SubscribingToTopics;

            /* Schedule the send_temperature function to publish a temperature reading
             * every 10 seconds */
            gTemperatureTaskHandle = xi_schedule_timed_task(
                in_context_handle, send_temperature, 10, 1, NULL );


            if ( XI_INVALID_TIMED_TASK_HANDLE == gTemperatureTaskHandle )
            {
                Report( "send_temperature_task couldn't be registered\n\r" );
            }
            else
            {
                /* Call it now so that we get a temperature reading immediately, too */
                send_temperature( in_context_handle, gTemperatureTaskHandle, NULL );
            }

            /* Green LED topic subscription */
            subscribe_to_topic( in_context_handle, XIVELY_GREEN_LED_CHANNEL_NAME,
                                on_led_topic, ( void* )&gGreenLed );

