xively/xively-client-c/examples/cc3220sf/xively_demo/xively_example.c
    /* parse Xively account & device credentials from config file */
    static char *xively_account_id = NULL, *xively_device_id = NULL,
                *xively_device_password = NULL;
    err |= parseKeyValue( config_file_context, XIVELY_ACNT_KEY, 1, &xively_account_id );
    err |= parseKeyValue( config_file_context, XIVELY_DEV_KEY, 1, &xively_device_id );
    err |=
        parseKeyValue( config_file_context, XIVELY_PWD_KEY, 1, &xively_device_password );

    /* optional - barse xively broker address and port from config file */
    static char *broker_name = NULL, *broker_port_str = NULL;
    if ( 0 != parseKeyValue( config_file_context, XIVELY_HOST_KEY, 0, &broker_name ) )
    {
        broker_name = XIVELY_DEFAULT_BROKER;
    }

    static uint16_t broker_port = XIVELY_DEFAULT_PORT;
    if ( 0 == parseKeyValue( config_file_context, XIVELY_PORT_KEY, 0, &broker_port_str ) )
    {
        if ( 0 == ( broker_port = atoi( broker_port_str ) ) )
        {
            Report( ". \"%s\" value \"%s\" is an invalid \"port\" value\n",
                    XIVELY_PORT_KEY, broker_port_str );
            err = -1;
        }
    }

    /* if everything is ok so far then do some sanity checks on the string sizes and the
     * parsed values. */
    if ( !err )
    {
        err |= validateWifiConfigurationVariables( wifi_ssid, wifi_password,
                                                   wifi_security_type );

        err |= validateXivelyCredentialBufferRequirement( XIVELY_ACNT_KEY,
                                                          xively_account_id );
        err |=
            validateXivelyCredentialBufferRequirement( XIVELY_DEV_KEY, xively_device_id );
        err |= validateXivelyCredentialBufferRequirement( XIVELY_PWD_KEY,
                                                          xively_device_password );
    }

    /* one last check before we start copying memory around */
    if ( err )
    {
        Report( "\n\rCritical configuration error(s) found when parsing configuration "
                "file\n\r" );
        Report( "Looping forever.\n\r" );
        while ( 1 )
            ;
    }

    /* assign the variables into the Application Control Block. */
    gApplicationControlBlock.desiredWifiSecurityType =
        mapWifiSecurityTypeStringToInt( ( const char* )wifi_security_type );
    memcpy( gApplicationControlBlock.desiredWifiSSID, wifi_ssid, strlen( wifi_ssid ) );
    memcpy( gApplicationControlBlock.desiredWifiKey, wifi_password,
            strlen( wifi_password ) );

    memcpy( gApplicationControlBlock.xivelyAccountId, xively_account_id,
            strlen( xively_account_id ) );
    memcpy( gApplicationControlBlock.xivelyDeviceId, xively_device_id,
            strlen( xively_device_id ) );
    memcpy( gApplicationControlBlock.xivelyDevicePassword, xively_device_password,
            strlen( xively_device_password ) );

    /* cleanup */
    free_config_entries( config_file_context );
}

/* @brief helper function that uses the config_file parser to parse a value for the
 * provided key.
 *
 * @param config_file_context this value returned from the creation of the config_file
 * parser.
 * This context is required for all config_file operations.
 * @param key a string to use as a lookup key for the key/value pairs in the config file.
 * @param is_required when set to a non-zero value, an error will be logged to the console
 * if the
 * specified key could not be found in the configuration file.  This does not effect the
 * return value
 * of this function.
 * @retval 0 on successful parse of parameter. -1 if parameter does not exist in the
 * configuration file,
 * or if another error has occurred.
 */
int8_t parseKeyValue( config_entry_t* config_file_context,
                      const char* key,
                      const uint8_t is_required,
                      char** out_value )
{
    int8_t retVal = 0;
    if ( NULL == out_value )
    {
        Report( "parseRequiredKeyValue error: out_value parameter is NULL!\n\r" );
        retVal = -1;
    }
    else if ( NULL == key )
    {
        Report( "parseRequiredKeyValue error: in_key parameter is NULL!\n\r" );
        retVal = -1;
    }
    else
    {
        *out_value = get_config_value( config_file_context, key );
        if ( NULL == *out_value )
        {
            retVal = -1;
            if ( is_required )
            {
                Report( "Could not find an entry for \"%s\" key in configuration file\n",
                        key );
            }
        }
    }

    return retVal;
}

/* @brief helper function. checks to if wifi credentials are of the right size
 * and type to match simplielink API
 *
 * @param wifi_ssid The wifi network name.
 * @param wifi_ssid The wifi password
 * @param wifi_ssid a string that represents the suffix of one of the valid
 * simplelink enumerated types. For instance "wpa" would be mapped to
 * SL_WLAN_SEC_TYPE_WPA.  This check is done in mapWifiSecurityTypeStringToInt().
 * @retval 0 if parameters are valid, -1 otherwise.
 */
int8_t validateWifiConfigurationVariables( const char* wifi_ssid,
                                           const char* wifi_password,
                                           const char* wifi_security_type )
{
    int8_t retVal = 0;

    /* SSID / wifi name checks */
    if ( strlen( wifi_ssid ) > SSID_LEN_MAX )
    {
        retVal = -1;
        Report( ". \"%s\" string is too long for CC3220 wifi configuration: \"%s\"\n\r",
                WIFI_SSID_KEY, wifi_ssid );
        Report( ". Max String Length is: %d\n\r", SSID_LEN_MAX );
    }

    /* wifi password checks */
    if ( strlen( wifi_password ) > WIFI_KEY_LEN_MAX )
    {
        retVal = -1;
        Report( ". Value for \"%s\" string is too big: \"%s\"\n\r", WIFI_SSID_KEY,
                wifi_password );
        Report( ". Please reconfigure WIFI_KEY_LEN_MAX in xively_example.h to increase "
                "the buffer size\n\r" );
        Report( ". Max String Length is: %d\n\r", WIFI_KEY_LEN_MAX );
    }

    /* Security type enum checks */
    int8_t wifi_security_type_enum =
        mapWifiSecurityTypeStringToInt( ( const char* )wifi_security_type );
    if ( wifi_security_type < 0 )
    {
        retVal = -1;
        Report( ". Could not find valid \"%s\" ", WIFI_SEC_TYPE_KEY );
        Report( " in xively configuration file \"%s\"\n\r", XIVELY_CFG_FILE );
    }

    if ( 0 == strcmp( wifi_ssid, WIFI_DEFAULT_CONFIG_FIELD_VALUE ) )
    {
        retVal = -1;
        Report( ". Default WiFi SSID field entry found.\n\r" );
        Report( "   Did you forget to edit the configuration file \"%s\"?\n\r",
                XIVELY_CFG_FILE );
    }

